Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.MullionProfileContainsOpenLoop Property
 The selected mullion profile contains an open profile loop and cannot be used. Valid profiles can only have closed profile loop(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MullionProfileContainsOpenLoop { get; }
Public Shared ReadOnly Property MullionProfileContainsOpenLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MullionProfileContainsOpenLoop {
	FailureDefinitionId^ get ();
}
static member MullionProfileContainsOpenLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace